Repository: whisperlab/lingo.dev
Catalog: packages/cli/demo/xcode-xcstrings/Localizable.xcstrings
Source language: en
Languages: es, zh_hans

source: and
es: y
zh_hans: 和

source: /mo
es: /mes
zh_hans: /月

source: %lld files
es: %lld archivos
zh_hans: %lld 个文件

# %lld/%lld files
source: %1$lld/%2$lld files
es: %1$lld/%2$lld archivos
zh_hans: %1$lld/%2$lld 个文件

source: + Make "%@.swift"
es: + Crear "%@.swift"
zh_hans: + 创建 “%@.swift”

source: + top-up for $9 / 250 messages
es: + recarga por $9 / 250 mensajes
zh_hans: + 充值 $9 / 250 条消息

source: ⌘⌫ stop
es: ⌘⌫ detener
zh_hans: ⌘⌫ 停止

source: ⌘⏎ codebase
es: ⌘⏎ base de código
zh_hans: ⌘⏎ 代码库

source: $0/mo
es: $0/mes
zh_hans: $0/月

source: 5 Code Applies
es: 5 aplicaciones de código
zh_hans: 5 次代码应用

source: 5 Git Commit Generations
es: 5 generaciones de commits de Git
zh_hans: 5 次 Git 提交信息生成

source: 5 Voice Inputs
es: 5 entradas de voz
zh_hans: 5 次语音输入

source: 50 Chat Messages
es: 50 mensajes de chat
zh_hans: 50 条对话消息

source: 50 Tab-to-Completes
es: 50 autocompletados con tabulación
zh_hans: 50 次 Tab 自动补全

source: 750 Chat Messages / month
es: 750 mensajes de chat / mes
zh_hans: 750 条对话消息/月

source: Accept and Commit
es: Aceptar y confirmar
zh_hans: 接受并提交

source: Account
es: Cuenta
zh_hans: 账户

source: Account View
es: Vista de cuenta
zh_hans: 账户视图

source: Add
es: Añadir
zh_hans: 添加

source: Add File
es: Añadir archivo
zh_hans: 添加文件

source: Add New Model
es: Añadir nuevo modelo
zh_hans: 添加新模型

source: Add New Prompt
es: Añadir nuevo prompt
zh_hans: 添加新提示

source: Add selected lines to context
es: Añadir líneas seleccionadas al contexto
zh_hans: 将所选行添加到上下文

source: Add web page from browser (Cmd+L)
es: Añadir página web desde el navegador (Cmd+L)
zh_hans: 从浏览器添加网页 (Cmd+L)

source: Admin
es: Administrador
zh_hans: 管理员

source: Admin Settings
es: Ajustes de administrador
zh_hans: 管理员设置

source: Advanced Search Panel
es: Panel de búsqueda avanzada
zh_hans: 高级搜索面板

source: Agent (Sonnet)
es: Agente (Sonnet)
zh_hans: 智能体（Sonnet）

source: Agent Mode
es: Modo agente
zh_hans: 智能体模式

source: Agent Settings
es: Ajustes del agente
zh_hans: 智能体

source: Alpha
es: Alfa

source: Already have an account?
es: ¿Ya tienes una cuenta?
zh_hans: 已经有账户？

source: Anthropic Key
es: Clave de Anthropic
zh_hans: Anthropic 密钥

source: API Key
es: Clave API
zh_hans: API 密钥

source: Apple Docs
es: Documentación de Apple
zh_hans: 苹果文档

source: Apple Docs (Individual)
es: Documentación de Apple (Individual)
zh_hans: 苹果文档（单个）

source: Apply Panel
es: Panel de aplicación
zh_hans: 应用面板

source: Are you sure you want to delete this chat?
es: ¿Estás seguro de que quieres eliminar este chat?
zh_hans: 确定要删除此对话吗？

source: Are you sure you want to delete this memory? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar esta memoria? Esta acción no se puede deshacer.
zh_hans: 确定要删除此上下文吗？此操作无法撤销。

source: Are you sure you want to log out?
es: ¿Estás seguro de que quieres cerrar sesión?
zh_hans: 确定要退出登录吗？

source: Auto context
es: Contexto automático
zh_hans: 自动关联上下文

source: Auto-activate sidebar on hover
es: Activar automáticamente la barra lateral al pasar el cursor
zh_hans: 鼠标悬停时自动激活侧栏

source: Auto-activate sidebar when Xcode is activated
es: Activar automáticamente la barra lateral cuando se active Xcode
zh_hans: 跟随 Xcode 显示侧栏

source: Auto-position window next to Xcode
es: Posicionar automáticamente la ventana junto a Xcode
zh_hans: 窗口自动对齐 Xcode

source: Auto-send voice transcriptions
es: Enviar automáticamente transcripciones de voz
zh_hans: 自动发送语音转录

source: Autofix Issues
es: Corregir problemas automáticamente
zh_hans: 自动修复问题

source: Base URL
es: URL base
zh_hans: 基础 URL

source: Billing & Usage
es: Facturación y uso
zh_hans: 账单与使用情况

source: Billing History
es: Historial de facturación
zh_hans: 账单历史

source: Buy More
es: Comprar más
zh_hans: 购买更多

source: By signing in, Alex will be happy again.
es: Al iniciar sesión, Alex volverá a estar feliz.
zh_hans: 登录后，Alex 将再次正常工作。

source: By signing up, you agree to our
es: Al registrarte, aceptas nuestros
zh_hans: 注册即表示您同意我们的

source: Can send images
es: Puede enviar imágenes
zh_hans: 可以发送图片

source: Cancel
es: Cancelar
zh_hans: 取消

source: Category
es: Categoría
zh_hans: 类别

source: Changes committed successfully!
es: ¡Cambios confirmados con éxito!
zh_hans: 更改提交成功！

source: Chat Models
es: Modelos de chat
zh_hans: 对话模型

source: Chat Settings
es: Ajustes de chat
zh_hans: 对话设置

source: Check Plan Options
es: Ver opciones de plan
zh_hans: 查看方案选项

source: Clear
es: Limpiar
zh_hans: 清除

source: Code Applies
es: Aplicaciones de código
zh_hans: 代码应用

source: Codebase
es: Base de código
zh_hans: 代码库

source: Confirm override path
es: Confirmar ruta de anulación
zh_hans: 确认覆盖路径

source: Copy Message
es: Copiar mensaje
zh_hans: 复制消息

source: Create new chat with selected lines
es: Crear nuevo chat con las líneas seleccionadas
zh_hans: 使用所选行创建新对话

source: Current Directory:
es: Directorio actual:
zh_hans: 当前目录：

source: Custom Models
es: Modelos personalizados
zh_hans: 自定义模型

source: Custom Prompts
es: Prompts personalizados
zh_hans: 自定义提示

source: Debug Support
es: Soporte de depuración
zh_hans: 调试支持

source: Delete
es: Eliminar
zh_hans: 删除

source: Delete Chat
es: Eliminar chat
zh_hans: 删除对话

source: Delete Index
es: Eliminar índice
zh_hans: 删除索引

source: Delete Memory
es: Eliminar memoria
zh_hans: 删除上下文

source: Diff
es: Diferencias
zh_hans: Diff 差异

source: Discord Support
es: Soporte en Discord
zh_hans: Discord 支持

source: Display Name
es: Nombre para mostrar
zh_hans: 显示名称

source: Docs
es: Documentación
zh_hans: 文档

source: Don't have an account?
es: ¿No tienes una cuenta?
zh_hans: 还没有账户？

source: Email
es: Correo electrónico
zh_hans: 电子邮件

source: Enable Memory
es: Activar memoria
zh_hans: 启用上下文

source: Enable Voice Mode (Shift + Cmd + V)
es: Activar modo de voz (Mayús + Cmd + V)
zh_hans: 启用语音模式（Shift + Cmd + V）

source: Ending %@
es: Finalizando %@
zh_hans: 结束于 %@

source: Enter debug token
es: Introducir token de depuración
zh_hans: 输入调试令牌

source: Enter ID
es: Introducir ID
zh_hans: 输入 ID

source: Enter Key
es: Introducir clave
zh_hans: 输入密钥

source: Enter prompt here
es: Introduce el prompt aquí
zh_hans: 在此输入提示

source: Enter the name and value for the new prompt
es: Introduce el nombre y valor para el nuevo prompt
zh_hans: 输入新提示的名称和值

source: Enter URL
es: Introducir URL
zh_hans: 输入 URL

source: Enter your query
es: Introduce tu consulta
zh_hans: 输入您的查询

source: Expand %lld more lines
es: Expandir %lld líneas más
zh_hans: 展开 %lld 行更多内容

source: Feature Settings
es: Ajustes de funciones
zh_hans: 功能设置

source: Features and Keybindings
es: Funciones y atajos de teclado
zh_hans: 功能和快捷键

source: Files
es: Archivos
zh_hans: 文件

source: Fill to expand available width
es: Rellenar para expandir el ancho disponible
zh_hans: 自适应宽度

source: Free Beta
es: Beta gratuita
zh_hans: 公测版

source: Free Plan
es: Plan gratuito
zh_hans: 免费方案

source: Gemini Key
es: Clave de Gemini
zh_hans: Gemini 密钥

source: Generate Commit Message
es: Generar mensaje de commit
zh_hans: 生成提交信息

source: Git Commit Generation
es: Generación de commit de Git
zh_hans: Git 提交信息生成

source: Git Commits
es: Commits de Git
zh_hans: Git 提交

source: Git Status
es: Estado de Git
zh_hans: Git 状态

source: Hello, World!
es: ¡Hola, mundo!
zh_hans: 你好，世界！

source: How is my data used?
es: ¿Cómo se usa mi información?
zh_hans: 我的数据是如何被使用的？

source: I've applied the code
es: He aplicado el código
zh_hans: 我已应用了这段代码

source: If we request a remote debugging session with you through Discord, please enter the token here and click on "Start Debug Session".
es: Si solicitamos una sesión de depuración remota contigo a través de Discord, por favor introduce el token aquí y haz clic en "Iniciar sesión de depuración".
zh_hans: 如果我们通过 Discord 请求与您进行远程调试，请在此输入令牌并点击“Start Debug Session”。

# Important: Please update to version %@. %@
source: Important: Please update to version %1$@. %2$@
es: Importante: Por favor, actualiza a la versión %1$@. %2$@
zh_hans: 重要：请更新到版本 %1$@。%2$@

source: In agent mode, Claude 3.5 Sonnet is used by default because it is the best model for code generation. If you'd like to switch to a different model, disable agent mode. (You can always turn it back on in the Agent Settings dropdown.)
es: En modo agente, Claude 3.5 Sonnet se usa por defecto porque es el mejor modelo para generación de código. Si quieres cambiar a un modelo diferente, desactiva el modo agente. (Siempre puedes volver a activarlo en el menú desplegable de Ajustes del Agente.)
zh_hans: 在智能体模式下，默认使用 Claude 3.5 Sonnet，因为它是最适合代码生成的模型。如果您想切换到其他模型，请禁用智能体模式。 （您随时可以在智能体设置下拉菜单中重新启用它。）

source: Indexed
es: Indexado
zh_hans: 已索引

source: Indexed Files
es: Archivos indexados
zh_hans: 已索引文件

source: Inline completion
es: Autocompletado en línea
zh_hans: 行内代码补全

source: Join Discord
es: Unirse a Discord
zh_hans: 加入 Discord

source: Learn more about Agent best practices here: [https://docs.alexcodes.app/chat/context/agents](https://docs.alexcodes.app/chat/context/agents)
es: Aprende más sobre las mejores prácticas del Agente aquí: [https://docs.alexcodes.app/chat/context/agents](https://docs.alexcodes.app/chat/context/agents)
zh_hans: 在此了解更多关于智能体最佳实践： [https://docs.alexcodes.app/chat/context/agents](https://docs.alexcodes.app/chat/context/agents)

source: Line %lld
es: Línea %lld
zh_hans: 第 %lld 行

source: listening (press ⏎ to send)
es: escuchando (presiona ⏎ para enviar)
zh_hans: 正在聆听（按 ⏎ 发送）

source: listening (press ⏎ to stop)
es: escuchando (presiona ⏎ para detener)
zh_hans: 正在聆听（按 ⏎ 停止）

source: Load Index
es: Cargar índice
zh_hans: 加载索引

source: Loading billing information...
es: Cargando información de facturación...
zh_hans: 正在加载账单信息...

source: Log Out
es: Cerrar sesión
zh_hans: 退出登录

source: Logout
es: Cerrar sesión
zh_hans: 退出登录

source: Made in SwiftUI
es: Hecho en SwiftUI
zh_hans: 使用 SwiftUI 构建

source: Manage Subscription
es: Gestionar suscripción
zh_hans: 管理订阅

source: Manage Trial Subscription
es: Gestionar suscripción de prueba
zh_hans: 管理试用订阅

source: Match height with Xcode
es: Igualar altura con Xcode
zh_hans: 与 Xcode 高度匹配

source: Memory
es: Memoria
zh_hans: 上下文

source: Memory Settings
es: Ajustes de memoria
zh_hans: 上下文设置

source: Message Top Ups
es: Recargas de mensajes
zh_hans: 消息充值

source: Model ID
es: ID del modelo
zh_hans: 模型 ID

source: Model Settings
es: Ajustes del modelo
zh_hans: 模型设置

source: Models
es: Modelos
zh_hans: 模型

source: Monthly Messages
es: Mensajes mensuales
zh_hans: 每月消息数

source: Name
es: Nombre
zh_hans: 名称

source: No billing history available
es: No hay historial de facturación disponible
zh_hans: 无可用账单历史

source: No context selected
es: Ningún contexto seleccionado
zh_hans: 未选择任何上下文

source: No memories found
es: No se encontraron memorias
zh_hans: 未找到上下文

source: No Project Focused
es: Ningún proyecto enfocado
zh_hans: 没有专注的项目

source: No results found
es: No se encontraron resultados
zh_hans: 未找到结果

source: No userdata found
es: No se encontraron datos de usuario
zh_hans: 未找到用户数据

source: Not Indexed
es: No indexado
zh_hans: 未索引

source: Not logged in
es: No ha iniciado sesión
zh_hans: 未登录

source: Note: This URL must be publicly available (not a localhost URL).
es: Nota: Esta URL debe estar disponible públicamente (no una URL de localhost).
zh_hans: 注意：此 URL 必须可公开访问（不能是 localhost）。

source: o1 Credits
es: Créditos o1
zh_hans: o1 额度

source: O1-Preview Credits
es: Créditos O1-Preview
zh_hans: O1-Preview 额度

source: Only for this project, and will be used in combination with your custom system prompt.
es: Solo para este proyecto, y se usará en combinación con su prompt de sistema personalizado.
zh_hans: 仅适用于此项目，并将与您的自定义系统提示组合使用。

source: Open Permission Settings
es: Abrir ajustes de permisos
zh_hans: 打开权限设置

source: OpenAI Key
es: Clave de OpenAI
zh_hans: OpenAI 密钥

source: Perplexity Key
es: Clave de Perplexity
zh_hans: Perplexity 密钥

source: Pin chat input to bottom
es: Fijar entrada de chat en la parte inferior
zh_hans: 将对话输入固定在底部

source: Please grant accessibility permissions so Alex can work with Xcode.
es: Por favor, conceda permisos de accesibilidad para que Alex pueda trabajar con Xcode.
zh_hans: 请授予辅助功能权限，以便 Alex 可以与 Xcode 协同工作。

source: Preview:
es: Vista previa:
zh_hans: 预览：

source: Privacy
es: Privacidad
zh_hans: 隐私

source: Privacy Policy
es: Política de privacidad
zh_hans: 隐私政策

source: Project-Specific Prompt
es: Prompt específico del proyecto
zh_hans: 项目特定提示

source: Prompt Name
es: Nombre del prompt
zh_hans: 提示名称

source: Purchase Subscription
es: Comprar suscripción
zh_hans: 购买订阅

source: Quick Actions:
es: Acciones rápidas:
zh_hans: 快捷操作：

source: record
es: grabar
zh_hans: 录制

source: Refresh
es: Actualizar
zh_hans: 刷新

source: Related Files:
es: Archivos relacionados:
zh_hans: 相关文件：

source: Reload Index
es: Recargar índice
zh_hans: 重新加载索引

source: Remote Debugging Session
es: Sesión de depuración remota
zh_hans: 远程调试会话

source: Remove
es: Eliminar
zh_hans: 移除

source: Rerank
es: Reordenar
zh_hans: 重新排序

source: Search chats...
es: Buscar chats...
zh_hans: 搜索对话...

source: Search files
es: Buscar archivos
zh_hans: 搜索文件

source: Search memories...
es: Buscar recuerdos...
zh_hans: 搜索上下文...

source: Select All
es: Seleccionar todo
zh_hans: 全选

source: Semantic
es: Semántico
zh_hans: 语义搜索

source: Settings
es: Ajustes
zh_hans: 设置

source: Show code apply view at bottom
es: Mostrar vista de aplicación de código en la parte inferior
zh_hans: 在底部显示代码应用视图

source: Show Hints
es: Mostrar pistas
zh_hans: 显示提示

source: Show less
es: Mostrar menos
zh_hans: 显示更少

source: Show suggestion details
es: Mostrar detalles de sugerencia
zh_hans: 显示建议详情

source: Shrink code view sections
es: Reducir secciones de vista de código
zh_hans: 收缩代码视图部分

source: Sign in
es: Iniciar sesión
zh_hans: 登录

source: Sign In
es: Iniciar sesión
zh_hans: 登录

source: Sign in with Google
es: Iniciar sesión con Google
zh_hans: 使用 Google 登录

source: Sign up
es: Registrarse
zh_hans: 注册

source: Sign Up
es: Registrarse
zh_hans: 注册

source: Sign up with Google
es: Registrarse con Google
zh_hans: 使用 Google 注册

source: Staged Changes
es: Cambios preparados
zh_hans: 已暂存更改

source: Standard
es: Estándar
zh_hans: 标准

source: Start Debug Session
es: Iniciar sesión de depuración
zh_hans: 开始调试会话

source: Start Free Trial (7 days)
es: Iniciar prueba gratuita (7 días)
zh_hans: 开始免费试用（7天）

source: Start Subscription
es: Iniciar suscripción
zh_hans: 开始订阅

source: Start without context
es: Iniciar sin contexto
zh_hans: 直接开始

source: Stop Debug Session
es: Detener sesión de depuración
zh_hans: 停止调试会话

source: Suggestion Details
es: Detalles de sugerencia
zh_hans: 建议详情

source: Suggestions
es: Sugerencias
zh_hans: 建议

source: Support
es: Soporte
zh_hans: 支持

source: System Prompt
es: Prompt del sistema
zh_hans: 系统提示

source: Tab-to-Complete suggestions (beta)
es: Sugerencias de autocompletado con tabulación (beta)
zh_hans: Tab 自动补全建议（测试版）

source: Terms of Service
es: Términos de servicio
zh_hans: 服务条款

source: Terms of Sevice
es: Términos de servicio
zh_hans: 服务条款

source: These go as additional info with the default system prompt
es: Estos van como información adicional con el prompt del sistema predeterminado
zh_hans: 这些将作为默认系统提示的附加信息

source: transcribing...
es: transcribiendo...
zh_hans: 正在转录...

source: Type something here (or ⌘+shift+v for voice)
es: Escribe algo aquí (o ⌘+shift+v para voz)
zh_hans: 在此输入内容（或按 ⌘+Shift+V 进行语音输入）

source: Unlimited Code Applies
es: Aplicaciones de código ilimitadas
zh_hans: 无限代码应用

source: Unlimited Tab-to-Complete
es: Autocompletado con tabulación ilimitado
zh_hans: 无限 Tab 自动补全

source: Unstaged Changes
es: Cambios no preparados
zh_hans: 未暂存更改

source: Update
es: Actualizar
zh_hans: 更新

source: Update available
es: Actualización disponible
zh_hans: 有可用更新

source: Update to %@
es: Actualizar a %@
zh_hans: 更新至 %@

source: Usage
es: Uso
zh_hans: 使用情况

source: Use Agent
es: Usar agente
zh_hans: 智能体

source: Use Agent Mode
es: Usar modo agente
zh_hans: 使用智能体模式

source: User Activities
es: Actividades del usuario
zh_hans: 用户活动

source: Using Codebase Search
es: Usando búsqueda en la base de código
zh_hans: 使用代码库搜索

source: Using Docs
es: Usando documentación
zh_hans: 使用文档

source: Voice Inputs
es: Entradas de voz
zh_hans: 语音输入

source: Voice Mode
es: Modo de voz
zh_hans: 语音模式

source: VoyageAI Key
es: Clave de VoyageAI
zh_hans: VoyageAI 密钥

source: Waiting for model%@
es: Esperando el modelo%@
zh_hans: 等待模型 %@

source: Want to buy O1 credits? Join the Discord and message @DanielEdrisian
es: ¿Quieres comprar créditos O1? Únete al Discord y envía un mensaje a @DanielEdrisian
zh_hans: 想要购买 O1 额度吗？加入 Discord 并联系 @DanielEdrisian

source: We conduct all of our support through Discord. We also send new feature announcements there!
es: Realizamos todo nuestro soporte a través de Discord. ¡También enviamos anuncios de nuevas funciones allí!
zh_hans: 我们的所有支持都在 Discord 上进行。新功能公告也会在那里发布！

source: We couldn't find an exact match for this snippet. Please select the file to apply to:
es: No pudimos encontrar una coincidencia exacta para este fragmento. Por favor, selecciona el archivo al que aplicarlo:
zh_hans: 我们无法为此代码片段找到确切匹配。请选择要应用的文件：

source: What's new:
es: Novedades:
zh_hans: 更新内容：

source: When enabled, Alex will maintain context from your previous messages to provide more relevant responses.
es: Cuando está activado, Alex mantendrá el contexto de tus mensajes anteriores para proporcionar respuestas más relevantes.
zh_hans: 启用后，Alex 将保留先前消息的上下文，以提供更相关的回答。

source: Why?
es: ¿Por qué?
zh_hans: 为什么？

source: Window Management
es: Gestión de ventanas
zh_hans: 窗口管理

source: Window Settings
es: Ajustes de ventana
zh_hans: 窗口设置

source: You can add custom models that comply with the OpenAI API scheme. Just add the base url, model name, and api key.
es: Puedes añadir modelos personalizados que cumplan con el esquema de la API de OpenAI. Solo añade la url base, el nombre del modelo y la clave api.
zh_hans: 您可以添加符合 OpenAI API 规范的自定义模型。只需添加基础 URL、模型名称和 API 密钥即可。

source: ⏎ chat
zh_hans: ⏎ 对话

source: No
zh_hans: 否

source: Plan
zh_hans: 方案

source: Popular
zh_hans: 热门
